aaron-bond.better-comments
aws-scripting-guy.cform
bbenoist.Nix
bungcip.better-toml
DavidAnson.vscode-markdownlint
dcr30.lualinter
devCAT.lua-debug
DotJoshJohnson.xml
drewbourne.vscode-remark-lint
exiasr.hadolint
foxundermoon.shell-format
gccfeli.vscode-lua
GrapeCity.gc-excelviewer
groksrc.ruby
jirkafajfr.vscode-kitchen
keyring.Lua
markis.code-coverage
mauve.terraform
ms-azuretools.vscode-docker
ms-mssql.mssql
ms-python.python
ms-vscode.Go
p1c2u.docker-compose
Pendrica.chef
rebornix.ruby
redhat.vscode-yaml
shd101wyy.markdown-preview-enhanced
timonwong.shellcheck
vscodevim.vim
yzhang.markdown-all-in-one
zamarrowski.docker-vulnerability-extension
